[
    "I'm not interested in staying at {hotel_name}. Do you have any other options?",
    "{hotel_name} doesn't seem to fit my needs. Can we look at alternatives?",
    "The {hotel_name} is a bit too expensive for my budget. Are there cheaper options in {city}?",
    "I don't think {hotel_name} is the right choice for me. What else is available in {district}?",
    "The location of {hotel_name} isn't ideal. Do you have anything closer to the city center?",
    "{hotel_name} doesn't have the amenities I'm looking for. Can you suggest something else?",
    "I've heard mixed reviews about {hotel_name}. Are there any better-rated hotels in {city}?",
    "The {hotel_name} seems a bit outdated. Do you have any more modern options?",
    "I'm not keen on staying in {district}. Can we look at hotels in other areas of {city}?",
    "{hotel_name} doesn't offer free breakfast. Are there hotels that do in {city}?",
    "The rooms at {hotel_name} look too small. Do you have options with larger accommodations?",
    "I'm not comfortable with the cancellation policy at {hotel_name}. Are there more flexible options?",
    "The parking situation at {hotel_name} doesn't work for me. Any hotels with better parking in {city}?",
    "{hotel_name} is too far from public transportation. Can we find something more conveniently located?",
    "The {hotel_name} doesn't seem very family-friendly. Do you have better options for kids in {city}?",
    "I'm looking for something with more character than {hotel_name}. Any boutique hotels in {district}?",
    "The {hotel_name} doesn't have a pool. Can you find me a hotel in {city} that does?",
    "I'm not impressed with the photos of {hotel_name}. Are there any nicer looking hotels in {district}?",
    "{hotel_name} doesn't offer room service. Can you suggest hotels in {city} that do?",
    "The gym at {hotel_name} looks inadequate. Are there hotels with better fitness facilities?",
    "I'm concerned about the noise levels at {hotel_name}. Any quieter options in {city}?",
    "The {hotel_name} seems too corporate. Do you have any cozier, homelier options?",
    "I'm not sure about the safety of {district}. Can we look at hotels in safer areas of {city}?",
    "{hotel_name} doesn't seem very accessible. Are there hotels with better facilities for disabled guests?",
    "The Wi-Fi at {hotel_name} has poor reviews. Can you find a hotel with reliable internet in {city}?",
    "I'm not keen on the decor at {hotel_name}. Are there any more stylish options in {district}?",
    "The {hotel_name} doesn't have balconies. Can you suggest hotels in {city} with outdoor space?",
    "I'm worried about bed bugs at {hotel_name}. Are there any hotels with better cleanliness ratings?",
    "{hotel_name} doesn't allow pets. Can you find pet-friendly options in {city}?",
    "The {hotel_name} seems too touristy. Are there any hotels where locals might stay in {district}?",
    "I'm not impressed with the restaurant at {hotel_name}. Are there hotels with better dining options?",
    "The {hotel_name} doesn't have air conditioning. Can you find hotels in {city} that do?",
    "{hotel_name} is too close to the airport. Can we look at quieter locations in {city}?",
    "The {hotel_name} doesn't offer shuttle services. Are there hotels in {city} that provide transportation?",
    "I'm not comfortable with the shared bathroom situation at {hotel_name}. Any options with private bathrooms?",
    "The {hotel_name} doesn't seem eco-friendly. Are there any green hotels in {city}?",
    "{hotel_name} doesn't have good views. Can you suggest hotels with better scenery in {district}?",
    "The {hotel_name} doesn't offer late check-out. Are there more flexible hotels in {city}?",
    "I'm not satisfied with the bed types at {hotel_name}. Can you find hotels with better sleeping arrangements?",
    "The {hotel_name} doesn't have a bar. Are there hotels in {district} with good nightlife options?",
    "{hotel_name} seems too crowded. Can you suggest a more intimate hotel in {city}?",
    "The {hotel_name} doesn't offer cribs for babies. Are there more family-oriented options in {city}?",
    "I'm concerned about the thin walls at {hotel_name}. Any hotels known for better soundproofing?",
    "The {hotel_name} doesn't have a business center. Can you find hotels in {city} better suited for work?",
    "{hotel_name} doesn't offer spa services. Are there any hotels with wellness facilities in {district}?",
    "The {hotel_name} seems too far from the attractions I want to visit. Any more centrally located options?",
    "I'm not impressed with the breakfast options at {hotel_name}. Are there hotels with better morning meals?",
    "The {hotel_name} doesn't have enough charging ports. Can you find a more tech-friendly hotel in {city}?",
    "{hotel_name} doesn't seem to cater to solo travelers. Are there better options for people traveling alone?",
    "The {hotel_name} doesn't offer cooking facilities. Can you suggest hotels in {city} with kitchenettes?",
    "Nah, I don't like it.",
    "Not my style.",
    "Pass.",
    "No thanks.",
    "That's not what I'm looking for.",
    "I'll pass on that one.",
    "Not feeling it.",
    "Doesn't appeal to me.",
    "Not quite right.",
    "Let's try something else.",
    "Meh, next option please.",
    "That's gonna be a no from me.",
    "Not impressed.",
    "Doesn't do it for me.",
    "I'm not sold on that one.",
    "Can we see other options?",
    "Not what I had in mind.",
    "Doesn't float my boat.",
    "That's not it.",
    "Not interested.",
    "Nope.",
    "Hard pass.",
    "Definitely not.",
    "That's a miss for me.",
    "Not feeling that vibe.",
    "Doesn't tick my boxes.",
    "I'll have to decline that one.",
    "Not my cup of tea.",
    "Think I'll skip that.",
    "Doesn't suit me."]